

打印 = print
输入 = input 

名字 = "小明"

句子 = f"您好{名字}，你今天如何呢？"



打印(句子)




输入("按回车ENTER 退出。")




##########################################

# 以上的代码和 "File04-03.py" 一样

# 试一试：
# 1. 如果你把括号里面的"名字"换了 会怎样呢？

#    名字 = "小明"
#    句子 = f"您好{外号}，你今天如何呢？"

###############################################################################

# 2. 如果你把全部的"名字"换成"外号" 会怎么样呢？

#    外号 = "小明"
#    句子 = f"您好{外号}，你今天如何呢？"

###############################################################################

# 3. 如果前面的 'f' 忘记写了，会怎么样呢？
#    e.g.

#    外号 = "小明"
#    句子 = "您好{外号}，你今天如何呢？"
#    打印(句子)
